2.2. Synthesis of Cu/C, Cu2O@Cu-CN and CN
Synthesis of Cu-BTC: 2.07 g Cu(NO3) in 20 mL deionized water was added into an H3BTC (1.05 g) solution containing 20 mL DMF and 20 mL ethanol. The mixture was stirred for 0.5 h and then heated at 110 °C for 18 h to obtain Cu-BTC powder.

Synthesis of MI-Cu-BTC: 0.10, 0.15, or 0.20 g MI was added in an H3BTC (1.05 g) solution containing 20 mL DMF and 20 mL ethanol. Then, 2.07 g Cu(NO3)2 in 20 mL deionized water was added. The mixture was stirred for 0.5 h and then heated at 110 °C for 18 h to obtain x-MI-Cu-BTC powder (x = 0.1, 0.15 or 0.20).

Cu-BTC or x-MI-Cu-BTC powder was calcined in a flow of argon to 300 °C at 2 °C/min, and then the temperature was raised to 800 °C at 5 °C/min for 3 h to obtain Cu/C or x-Cu2O@Cu-CN. N-doped carbon (CN) alone was prepared by the same pyrolysis approach of the mixture of MI and H3BTC (the proportion was equal to that in the synthesis of 0.15-Cu2O@Cu-CN).

2.3. Characterizations
Crystal structures were analyzed on a Rigaku X–ray diffractometer (XRD). X–ray photoelectron spectra (XPS) and Cu LMM Auger electron spectra (AES) were tested by Thermo Fisher Scientific XPS spectrograph. Morphologies were characterized by field–emission scanning electron microscope (FESEM, Hitachi 8010) and high–resolution transmission electron microscope (HRTEM, Hitachi–600). Thermogravimetric (TG) analysis was conducted by TGA5500. Surface area (SBET) and porosity of samples were analyzed by Quanta Chrome NOVA 1000. Atomic forces microscope (AFM) images were obtained from Bruker Dimension Icon AFM. Static water-droplet contact angle measurements were conducted using a DSA25E contact angle goniometer. Electron spin resonance (ESR) spectra were recorded on JES-FA 200. CO2 temperature programmed desorption (CO2-TPD) was studied by AutoChem1 II 2920. Ultraviolet photoelectron spectra (UPS) and valence band X–ray photoelectron spectra (VB XPS) were acquired by Thermo Scientific Escalab 250Xi X–ray photoelectron spectrometer. In situ Fourier transform infrared (FTIR) spectra were collected on a Thermo Scientific Nicolet iS50 spectrometer. The details of in situ FTIR test are shown in Text S1 in Supporting Information.